Охотники_и_рыболовы/src/Catalogs/Охотники/Охотники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Охотники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвалид1Группы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВетеранВОВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтатныйСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленККОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Улица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Catalogs/Охотники/ManagerModule.bsl
Процедура ПолучитьТабДок(ТабДок, ТабДокДляПечати,ПараметрыПечати) Экспорт
	
	Макет 			= Справочники.Охотники.ПолучитьМакет(ПараметрыПечати.ИмяМакета);
	МакетДляПечати 	= Справочники.Охотники.ПолучитьМакет(ПараметрыПечати.ИмяМакета + "ДляПечати");
	Ссылка 			= ПараметрыПечати.Справочник;
	
	
	
Запрос = Новый Запрос;
	Запрос.Текст =
	  "ВЫБРАТЬ
	  |	ЕСТЬNULL(КонтактнаяИнформация.Город, """") КАК Город,
	  |	ЕСТЬNULL(КонтактнаяИнформация.Улица, """") КАК Улица,
	  |	ЕСТЬNULL(КонтактнаяИнформация.Дом, """") КАК Дом,
	  |	ЕСТЬNULL(КонтактнаяИнформация.Квартира, """") КАК Квартира,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ГосБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.Серия, """")
	  |		КОНЕЦ) КАК ГОССерияБилета,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ГосБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.Номер, """")
	  |		КОНЕЦ) КАК ГОСНомерБилета,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ГосБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.ДатаВыдачи, """")
	  |		КОНЕЦ) КАК ГОСДатаВыдачи,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.ЗарегистрированВ, ""Без членского билета"")
	  |		КОНЕЦ) КАК ЗарегистрированВ,
	  |	Охотники.Фамилия,
	  |	Охотники.Имя,
	  |	Охотники.Отчество,
	  |	Охотники.ДатаРождения,
	  |	Охотники.НомерТелефона КАК НомерТелефона,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.Серия, """")
	  |		КОНЕЦ) КАК ЧЛСерияБилета,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.Номер, """")
	  |		КОНЕЦ) КАК ЧЛНомерБилета,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.ДатаВыдачи, """")
	  |		КОНЕЦ) КАК ЧЛДатаВыдачи,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.КемВыдан, """")
	  |		КОНЕЦ) КАК ЧЛКемВыдан,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ГосБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.КемВыдан, """")
	  |		КОНЕЦ) КАК ГОСКемВыдан
	  |ИЗ
	  |	Справочник.Охотники КАК Охотники
	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	  |		ПО Охотники.Ссылка = КонтактнаяИнформация.Охотник
	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОхотничьиБилеты КАК ОхотничьиБилеты
	  |		ПО (ОхотничьиБилеты.Действует)
	  |			И Охотники.Ссылка = ОхотничьиБилеты.Охотник
	  |ГДЕ
	  |	Охотники.Ссылка В(&Ссылка)
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	ЕСТЬNULL(КонтактнаяИнформация.Город, """"),
	  |	ЕСТЬNULL(КонтактнаяИнформация.Улица, """"),
	  |	ЕСТЬNULL(КонтактнаяИнформация.Дом, """"),
	  |	ЕСТЬNULL(КонтактнаяИнформация.Квартира, """"),
	  |	Охотники.Фамилия,
	  |	Охотники.Имя,
	  |	Охотники.Отчество,
	  |	Охотники.ДатаРождения,
	  |	Охотники.НомерТелефона"	;

			
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("ГосБилет",Перечисления.ВидыОхотничьихБилетов.ГосБилет);
	Запрос.Параметры.Вставить("ЧленскийБилет",Перечисления.ВидыОхотничьихБилетов.ЧленскийБилет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьОхотник			= Макет.ПолучитьОбласть("Охотник");
	ТабДок.Очистить();
	
	ОбластьОхотникДляПечати 	= МакетДляПечати.ПолучитьОбласть("Охотник");
	ТабДокДляПечати.Очистить();
	
	
	 
	а=1;

	СтруктураПараметров = Новый Структура;
		
	
	     Пока Выборка.Следующий() Цикл

		
		 ОбластьОхотник.Параметры.Заполнить(Выборка);
	 	 ОбластьОхотникДляПечати.Параметры.Заполнить(Выборка);
		
	
		ГОСДатаВыдачи	=  Формат(Выборка.ГОСДатаВыдачи,"ДФ = 'дд.ММ.гггг'");
		
		ЧЛДатаВыдачи 	=  Формат(Выборка.ЧЛДатаВыдачи, "ДФ = 'дд.ММ.гггг'");
	
		ДатаРождения	=  Формат(Выборка.ДатаРождения, "ДФ = 'дд.ММ.гггг'");
		
		СтруктураПараметров.Вставить("ДатаРождения",ДатаРождения);
		СтруктураПараметров.Вставить("ГОСДатаВыдачи",ГОСДатаВыдачи);
		СтруктураПараметров.Вставить("ЧЛДатаВыдачи",ЧЛДатаВыдачи);
		СтруктураПараметров.Вставить("ЧЛКемВыдан" + Строка(а),Выборка.ЧЛКемВыдан);
		СтруктураПараметров.Вставить("ЗарегистрированВ" + Строка(а),Выборка.ЗарегистрированВ);

		////////// параметры, которые не подставляются  
		СтруктураПараметров.Вставить("ГОСКемВыдан" + Строка(а),Выборка.ГОСКемВыдан);
		СтруктураПараметров.Вставить("ГОСНомерБилета" + Строка(а),Выборка.ГОСНомерБилета);
		СтруктураПараметров.Вставить("ГОССерияБилета" + Строка(а),Выборка.ГОССерияБилета);
		СтруктураПараметров.Вставить("ЧЛНомерБилета",Выборка.ЧЛНомерБилета);
		СтруктураПараметров.Вставить("ЧЛСерияБилета",Выборка.ЧЛСерияБилета);
		
		
		
		а = а + 1;
		ОбластьОхотник.Параметры.Заполнить(СтруктураПараметров);
		ОбластьОхотникДляПечати.Параметры.Заполнить(СтруктураПараметров);

	КонецЦикла;
	
		
			
	ТабДок.Вывести(ОбластьОхотник);
	
	ТабДок.ПолеСверху 		= 0;
	ТабДок.ПолеСнизу 		= 0;
	ТабДок.ПолеСлева 		= 0;
	ТабДок.ПолеСправа 		= 0;
	
	ТабДокДляПечати.Вывести(ОбластьОхотникДляПечати);
	ТабДокДляПечати.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокДляПечати.ПолеСверху 	= 0;
	ТабДокДляПечати.ПолеСнизу 	= 0;
	ТабДокДляПечати.ПолеСлева 	= 0;
	ТабДокДляПечати.ПолеСправа 	= 0;

	
КонецПроцедуры
